name: "tokenizer"
backend: "python"

max_batch_size: 8


input [
    {
        name: "TEXT"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]

output [
    {
        name: "INPUT_IDS"
        data_type: TYPE_INT64
        dims: [ 128 ]
    },
    {
        name: "ATTENTION_MASK"
        data_type: TYPE_INT64
        dims: [ 128 ]
    }
]


instance_group [
    {
        count: 4
        kind: KIND_CPU
    }
]
