name: "model_TRT_INT8"
platform: "tensorrt_plan"

max_batch_size: 8

input [
 {
    name: "INPUT_IDS"
    data_type: TYPE_INT64
    dims: [ 128 ]
 },
 {
    name: "ATTENTION_MASK"
    data_type: TYPE_INT64
    dims: [ 128 ]
 }
]

output [
 {
    name: "LOGITS"
    data_type: TYPE_FP32
    dims: [ -1, 816 ]
 }
]

instance_group [
  {
    kind: KIND_GPU
  }
]
